app/controllers/comments_controller.rb

  def create


=begin
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Hitsujikai"], ["body", "Dreaming Sheep!!><b"], ["post_id", 2], ["created_at", "2017-07-21 00:42:22.631680"], ["updated_at", "2017-07-21 00:42:22.631680"]]