app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "アハッハっ"], ["title", "面白いものについて"], ["content", "まあまあだねmうん"], ["created_at", "2017-07-20 06:21:13.969060"], ["updated_at", "2017-07-20 06:21:13.969060"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "name" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["name", "TESTER1"], ["title", "ハローキンイロモザイク"], ["updated_at", "2017-07-21 22:03:02.541250"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

UPDATE "posts" SET "like" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["like", 1], ["updated_at", "2017-07-24 19:38:49.958401"], ["id", 1]]
---
  def like
#    p "--------"
#    p @post.like
#    p "--------"
#    @post.like = @post.like + 1
#    p "--------"
#    p @post.like
#    p "--------"
    @post.update!(like: @post.like + 1)